"""
Все сообщения в боте форматируются с помощью Markdown.

https://core.telegram.org/bots/api#formatting-options
"""

class Messages:
    WELCOME_MSG = "👋 Добро пожаловать, {name}!"
    LANGUAGE_SELECTED = "✅ Язык установлен на русский"
    LANGUAGE_SELECTION = "🌐 Выбор языка"
    RUSSIAN = "🇷🇺 Русский"
    ENGLISH = "🇬🇧 English"

    #Вы можете редактировать сообщение информации о боте здесь, хотя я был бы признателен, если бы вы этого не сделали.
    INFO = """
🤖 *О боте*  

*Версия:* `1.0`  
*Поддерживаемые языки:* Русский, English  
*Автор:* [diplexion](https://github.com/diplexion) 
*Дата последнего обновления:* 2025-12-01  
*Исходный код:* [SourceCode]()
    """

    ERROR = "❌ Произошла ошибка. Обратитесь в поддержку."
    PROFILE_CREATED = "✅ Профиль успешно создан!"

    class Profile:
        MAIN ="""
👤 *Ваш профиль:*
    
🆔 {id}
👨‍💻 {language}
💰 *Баланс:* {balance}
        
📅 *Дата регистрации:* {registration_date}
            """

        TOP_UP_BALANCE = "💳 Пополнить баланс"
        class Stars:
            INPUT_AMOUNT = """
Курс звезд 1 к {exchange_rate}        

Введите количество звезд для пополнения:   
        """

            STARS_COUNT_ERROR = "❌ Пожалуйста, введите корректное количество звезд."

            PAY_STARS_BUTTON = "Оплатить ⭐️"

    class Store:
        STORE_MAIN = """
🏬 *Магазин TeleCommerce*
    
Выберите категорию товара:    
        """