"""
Все сообщения в боте форматируются с помощью Markdown.

https://core.telegram.org/bots/api#formatting-options
"""

class Messages:
    WELCOME_MSG = "👋 Добро пожаловать, {name}!"
    LANGUAGE_SELECTED = "✅ Язык установлен на русский"
    LANGUAGE_SELECTION = "🌐 Выбор языка"
    RUSSIAN = "🇷🇺 Русский"
    ENGLISH = "🇬🇧 English"

    #Вы можете редактировать сообщение информации о боте здесь, хотя я был бы признателен, если бы вы этого не делали.
    INFO = """
🤖 *О боте*  

*Версия:* `1.0`  
*Поддерживаемые языки:* Русский, English  
*Автор:* [diplexion](https://github.com/diplexion) 
*Дата последнего обновления:* 2025-12-01  
*Исходный код:* [SourceCode](https://github.com/diplexion/TeleCommerce)
    """

    ERROR = "❌ Произошла ошибка. Обратитесь в поддержку."
    PROFILE_CREATED = "✅ Профиль успешно создан!"

    class Profile:
        MAIN ="""
👤 *Профиль пользователя*

*Имя:* `{user_name}`  
*ID:* `{id}`  
*Язык:* `{language}`

*Баланс:* `{balance}₽`  
*Активные бонусы:* `0` (In development)

📅 *Зарегистрирован:* `{registration_date}`

🎟 *Реферальный код:* `` (In development)
            """

        BACK_TO_PROFILE = "🔙 Вернуться в профиль"

        TOP_UP_BALANCE_BUTTON = "💳 Пополнить баланс"

        TOP_UP_BALANCE_TITLE = """
*💳 Пополнение баланса*

Выберите способ пополнения:

• ⭐ *Telegram Stars* — мгновенное пополнение  
• 🪙 *Crypto* — удобный способ через криптовалюту

Нажмите на нужный вариант ниже 👇
        """

        TOP_UP_OPTIONS_CRYPTO_BUTTON = "💠 Crypto (в разработке)"

        TOP_UP_OPTIONS_STARS_BUTTON = "⭐️ Telegram Stars"

        BACK_TO_TOP_UP_BALANCE_BUTTON = "🔙 Назад к способам пополнения"

        class Stars:
            INPUT_AMOUNT = """
*⭐ Пополнение через Telegram Stars*

Текущий курс: *1 ⭐ = {exchange_rate} ₽*

Введите количество звёзд, которые хотите использовать для пополнения баланса:
   
        """

            STARS_COUNT_ERROR = "❌ Пожалуйста, введите корректное количество звезд."
            PAY_STARS_BUTTON = "Оплатить ⭐️"
            TITLE_STARS_PAYMENT = "Пополнение баланса с помощью TG Stars"
            DESCRIPTION_STARS_PAYMENT = "Пополнение баланса с помощью TG Stars: {amount} ️⭐️"
            SUCCESSFUL_PAYMENT = """
⭐ *Оплата через Telegram Stars прошла успешно!*

Вы оплатили: *{stars} ⭐*
Зачислено на баланс: *{rubles} ₽*
Ваш новый баланс: *{new_balance} ₽*

Способ оплаты: _Telegram Stars_
ID транзакции: `{transaction_id}`
Дата операции: `{date}`

Спасибо, {user_name}!  
Если возникли вопросы — напишите в поддержку: {support_contact}
            """

    class Store:
        STORE_MAIN = """
🏬 *Магазин TeleCommerce*
    
Выберите категорию товара:    
        """